nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe31b/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
    /* PTD27 (pin 132) is configured as LCU_0 LC0_OUT, 1 */
    const siul2_pin_settings_t BOARD_MC_ENC_INIT_PTD27 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 123u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_MC_ENC_INIT_PTD27);
    
    /* PTC24 (pin 88) is configured as LCU_0 LC0_OUT, 2 */
    const siul2_pin_settings_t BOARD_MC_ENC_INIT_PTC24 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 88u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_MC_ENC_INIT_PTC24);
    
    /* PTA1 (pin 135) is configured as LCU_0 LC0_OUT, 3 */
    const siul2_pin_settings_t BOARD_MC_ENC_INIT_PTA1 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 1u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_MC_ENC_INIT_PTA1);
    
    /* SIUL2 TRGMUX IN12 is selected as LCU0_0 device trigger input 0 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_Lcu0_0, kTRGMUX_TriggerInput0, kTRGMUX_SourceTriggerMuxInput12);
    /* SIUL2 TRGMUX IN13 is selected as LCU0_0 device trigger input 1 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_Lcu0_0, kTRGMUX_TriggerInput1, kTRGMUX_SourceTriggerMuxInput13);
    /* LCU_0 LC0 Out_i3 is selected as SIUL2 TRGMUX_OUT0 device trigger input 0 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_ExtOut0, kTRGMUX_TriggerInput0, kTRGMUX_SourceLcu0Lc0Out3);
    /* LCU_0 LC0 Out_i2 is selected as SIUL2 TRGMUX_OUT3 device trigger input 3 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_ExtOut3, kTRGMUX_TriggerInput3, kTRGMUX_SourceLcu0Lc0Out2);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
